# 577. Employee Bonus

Select all employeeâ€™s name and bonus whose bonus is < 1000.

Table:Employee

+-------+--------+-----------+--------+
| empId |  name  | supervisor| salary |
+-------+--------+-----------+--------+
|   1   | John   |  3        | 1000   |
|   2   | Dan    |  3        | 2000   |
|   3   | Brad   |  null     | 4000   |
|   4   | Thomas |  3        | 4000   |
+-------+--------+-----------+--------+
empId is the primary key column for this table.
Table: Bonus

+-------+-------+
| empId | bonus |
+-------+-------+
| 2     | 500   |
| 4     | 2000  |
+-------+-------+
empId is the primary key column for this table.
Example ouput:

+-------+-------+
| name  | bonus |
+-------+-------+
| John  | null  |
| Dan   | 500   |
| Brad  | null  |
+-------+-------+

In [1]:
import pandas as pd
import re
import numpy as np
Employee=pd.DataFrame({'empId':[1,2,3,4],'Name':['John','Dan','James','Thomas'],
'supervisor':[3,3,'null',3],'Salary':[1000,2000,4000,4000]})
Employee=Employee[['empId','Name','supervisor','Salary']]
Employee

   empId    Name supervisor  Salary
0      1    John          3    1000
1      2     Dan          3    2000
2      3   James       null    4000
3      4  Thomas          3    4000

In [2]:
Bonus=pd.DataFrame({'empId':[2,4],'bonus':[500,2000]})
Bonus=Bonus[['empId','bonus']]
Bonus

   empId  bonus
0      2    500
1      4   2000

In [3]:
pmee=pd.merge(Employee,Bonus,on='empId', how='left')
pmee

   empId    Name supervisor  Salary   bonus
0      1    John          3    1000     NaN
1      2     Dan          3    2000   500.0
2      3   James       null    4000     NaN
3      4  Thomas          3    4000  2000.0

In [4]:
pmee = pmee.replace('nan', np.nan).fillna(0)
pmee

   empId    Name supervisor  Salary   bonus
0      1    John          3    1000     0.0
1      2     Dan          3    2000   500.0
2      3   James       null    4000     0.0
3      4  Thomas          3    4000  2000.0

In [5]:
output1=pmee[pmee.bonus<1000][['Name','bonus']]
output1

    Name  bonus
0   John    0.0
1    Dan  500.0
2  James    0.0

In [6]:
print(output1.to_string(index=False))

Name  bonus
 John    0.0
  Dan  500.0
James    0.0